In [1]:
import pandas as pd

In [4]:
DF1 = pd.DataFrame({'NOMBRE':['Jose','Max'],
                    'CARRERA':['Economia','ARQUITECTURA'],
                    'EDAD':[23,26]}).set_index('NOMBRE')

In [5]:
DF2 = pd.DataFrame({'NOMBRE':['aURORA','Maria'],
                    'CARRERA':['Medicina','Informatica'],
                    'EDAD':[14,56]}).set_index('NOMBRE')

In [12]:
DF = pd.concat([DF1,DF2])

In [7]:
DF1

             CARRERA  EDAD
NOMBRE
Jose        Economia    23
Max     ARQUITECTURA    26

In [8]:
DF2

            CARRERA  EDAD
NOMBRE
aURORA     Medicina    14
Maria   Informatica    56

In [13]:
DF

             CARRERA  EDAD
NOMBRE
Jose        Economia    23
Max     ARQUITECTURA    26
aURORA      Medicina    14
Maria    Informatica    56